package com.epam.text;

/**
 * 2.Работа с текстом (In honor of String).
 * - Вывести все предложения текста в порядке возрастания количества слов в каждом из них.
 * - В каждом предложении текста поменять местами первое слово с последним не изменяя длинны предложения.
 * - В некотором предложении текста слова заданной длинны заменить указанной подстрокой,
 * длинна которой может не совподать с длинной слова.
 * - log4J2
 * - Patterns: Composite, Chain Of Responsibility
 * <p>
 * 20 Aug 2021  * @author
 * Pavel Sirotsin
 */

public class Main {

}
